app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Kevin"], ["comment", "This is awesome"], ["created_at", "2019-08-06 21:22:39.798950"], ["updated_at", "2019-08-06 21:22:39.798950"], ["post_id", 5]]
---
    def create
		@post = Post.find(params[:post_id])
	 	@comment = @post.comments.create(params[:comment].permit(:name, :comment))