app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second post"], ["content", "my second post"], ["updated_at", "2019-08-06 18:58:52.187616"], ["id", 2]]
---
  def update
    if @post.update(post_params)